{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report linking layout update to Player and BreathingCircle files.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Tailwind base plus CSS variables for light/dark themes and global background/foreground tokens.",
  "frontend/index.html": "HTML entry file loading main.tsx and PWA manifest with favicon.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, colors, orientation, and icons.",
  "frontend/src/App.tsx": "Main router layout with header, tabbed footer navigation, and route configuration.",
  "frontend/src/components/BreathingCircle.tsx": "Animated breathing circle that changes color, text, and timing based on phase state.",
  "frontend/src/components/charts/BreathHoldLineChart.tsx": "Draws an SVG line chart of breath-hold durations with scaled points and optional empty-state text.",
  "frontend/src/components/charts/WeeklyMinutesBarChart.tsx": "Shows a weekly bar chart of minutes with dynamic bar heights and labels.",
  "frontend/src/components/CustomPatternForm.tsx": "Form for editing custom inhale/hold/exhale durations with numeric inputs.",
  "frontend/src/components/ExerciseTileCard.tsx": "Clickable exercise card with icon, info button, styling, and keyboard support.",
  "frontend/src/components/HomeExerciseCard.tsx": "Home screen exercise card with duration dialog, icon, description, and start handler.",
  "frontend/src/components/SessionList.tsx": "Renders a table of breathing sessions with formatted dates and durations, or a placeholder when empty.",
  "frontend/src/components/VerticalVolumeControl.tsx": "Displays a vertical slider wrapped in a styled card to control a numeric volume value.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBreathingEngine.ts": "Manages breathing phase timing, transitions, voice cues, haptics, and pause/resume logic for breathing exercises.",
  "frontend/src/hooks/useHaptics.ts": "Provides a simple vibration helper using the browser's navigator.vibrate API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identities, and related status flags.",
  "frontend/src/hooks/usePerExerciseDuration.ts": "Stores and retrieves per‑exercise durations from local storage with default fallbacks.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and releases screen wake locks based on an active flag with automatic cleanup.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, fonts, and breathing animation keyframes.",
  "frontend/src/lib/ambientAudio.ts": "Controls looping rain and wave audio with volume adjustments and exclusive playback.",
  "frontend/src/lib/breathingPatterns.ts": "Defines the BreathingPattern interface and preset breathing patterns with inhale/hold/exhale timings.",
  "frontend/src/lib/localStorageStore.ts": "Provides helpers to read and write breath-hold records, breathing sessions, and per-exercise durations in localStorage.",
  "frontend/src/lib/playerDurationGuards.ts": "Validates session duration inputs and determines when auto-stop is allowed during playback.",
  "frontend/src/lib/sessionTypes.ts": "Defines TypeScript interfaces for breath-hold records and breathing sessions.",
  "frontend/src/lib/statsDerivations.ts": "Generates daily minute totals, breath-hold chart data, and returns the latest ten breathing sessions.",
  "frontend/src/lib/storageKeys.ts": "Defines constant localStorage keys for session and settings data.",
  "frontend/src/lib/voiceGuidance.ts": "Controls speech synthesis volume, speaking, async speaking, and canceling voice guidance.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/About.tsx": "Displays app information, premium features teaser, and quick settings with navigation.",
  "frontend/src/pages/Custom.tsx": "Allows users to build a custom breathing pattern and start a session with it.",
  "frontend/src/pages/Home.tsx": "Shows preset breathing exercises, configurable durations, and a breath-holding test entry.",
  "frontend/src/pages/Player.tsx": "Runs the breathing session player with timing, voice guidance, ambient audio, auto-stop, and session logging.",
  "frontend/src/pages/Settings.tsx": "Provides UI toggles for audio, haptics, and notification-related settings.",
  "frontend/src/pages/Stats.tsx": "Renders the stats dashboard, loading recent breathing sessions and breath-hold data to display charts and a history table.",
  "frontend/src/pages/Test.tsx": "Implements a breath-hold timer with start/stop logic, tracking elapsed time and storing new records in local storage.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load to enable basic PWA support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, breakpoints, and plugins for the project.",
  "project_state.json": "Contains the project’s versioned state description, feature list, and high-level summary of the app’s capabilities."
}