{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic.",
  "feature_evidence.json": "Feature evidence report listing voice‑guidance‑related bugs, file touchpoints, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing styling, PWA setup, state helpers, hooks, and Player/voice‑guidance logic.",
  "frontend/index.css": "Tailwind base layers plus extensive CSS variable themes for light/dark modes and global border/background styles.",
  "frontend/index.html": "HTML entry point loading the React app with PWA manifest, theme color, and favicon.",
  "frontend/public/manifest.json": "PWA manifest defining metadata, start URL, colors, orientation, and icons.",
  "frontend/src/App.tsx": "App routing and layout with header logic, conditional footer tabs, and route-based navigation.",
  "frontend/src/components/BreathCyclesDurationDialog.tsx": "Dialog for selecting breathing cycles, computing total duration, and saving a chosen preset.",
  "frontend/src/components/BreathingCircle.tsx": "Breathing animation circle showing phase color, timing, and optional segmented session progress.",
  "frontend/src/components/charts/BreathHoldLineChart.tsx": "SVG line chart plotting breath-hold durations over time with labeled endpoints.",
  "frontend/src/components/charts/WeeklyMinutesBarChart.tsx": "Vertical bar chart showing weekly minutes with proportional bar heights.",
  "frontend/src/components/CustomPatternForm.tsx": "Form component for editing inhale, hold, and exhale durations of a BreathingPattern with numeric inputs.",
  "frontend/src/components/ExerciseTileCard.tsx": "Clickable tile card displaying an exercise’s icon, title, description, and an info button.",
  "frontend/src/components/HomeExerciseCard.tsx": "Interactive exercise card with start action, optional duration editing dialog, and an info button.",
  "frontend/src/components/SegmentedCircumferenceProgress.tsx": "Renders a segmented circular progress indicator based on elapsed and total duration.",
  "frontend/src/components/SessionList.tsx": "Table listing past breathing sessions with formatted date and duration.",
  "frontend/src/components/VerticalVolumeControl.tsx": "Vertical slider control for adjusting a numeric value with optional icon display.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing an authenticated or anonymous backend actor and invalidating dependent queries.",
  "frontend/src/hooks/useBreathingEngine.ts": "Hook managing breathing phases, timing, voice cues, and haptics for a guided breathing pattern.",
  "frontend/src/hooks/useHaptics.ts": "Simple hook providing a vibration helper using the browser’s vibrate API.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/usePerExerciseDuration.ts": "Hook managing per-exercise durations via localStorage with default fallback and setters.",
  "frontend/src/hooks/useWakeLock.ts": "Hook that requests or releases a screen wake lock based on an active flag.",
  "frontend/src/index.css": "Global Tailwind-based styles defining theme variables, typography, and breathing animations.",
  "frontend/src/lib/ambientAudio.ts": "Controller class for looping rain and wave audio with volume control and exclusive playback.",
  "frontend/src/lib/breathingPatterns.ts": "Defines preset breathing patterns and a utility to compute safe cycle lengths.",
  "frontend/src/lib/exerciseInfoContent.ts": "Static descriptive content for each breathing exercise, including intros and sections.",
  "frontend/src/lib/localStorageStore.ts": "Utility functions for storing and retrieving breath records, sessions, and exercise durations from localStorage.",
  "frontend/src/lib/playerDurationGuards.ts": "Validation helpers ensuring safe session durations and guarding against premature auto-stop.",
  "frontend/src/lib/sessionTypes.ts": "Type definitions for breath-hold records and breathing session objects.",
  "frontend/src/lib/settingsStore.ts": "LocalStorage-backed getters and setters for ambient mode, volume, and meditation settings.",
  "frontend/src/lib/statsDerivations.ts": "Functions deriving stats like last 7 days minutes, breath-hold chart data, and recent sessions.",
  "frontend/src/lib/storageKeys.ts": "Constants defining all localStorage key names used by the app.",
  "frontend/src/lib/voiceGuidance.ts": "Implements volume control and multiple speech synthesis helpers, including queued and async speech plus a cancel function.",
  "frontend/src/main.tsx": "Initializes React app root with React Query and Internet Identity provider, rendering the main App.",
  "frontend/src/pages/About.tsx": "Displays app information, premium upsell, and quick settings with navigation back to home.",
  "frontend/src/pages/Custom.tsx": "Provides a form for creating a custom breathing pattern and selecting cycle count before starting the player.",
  "frontend/src/pages/ExerciseInfo.tsx": "Shows detailed info for a selected exercise and allows starting the mapped breathing pattern.",
  "frontend/src/pages/Home.tsx": "Renders exercise tiles with durations, navigation to info pages, and start actions for preset patterns and a test.",
  "frontend/src/pages/Player.tsx": "Runs the breathing session player, loading pattern and settings, managing audio, wake lock, duration, and session logging.",
  "frontend/src/pages/Settings.tsx": "Renders the settings page allowing users to configure voice guidance, ambient sounds, and other feedback options using values persisted in settingsStore.",
  "frontend/src/pages/Stats.tsx": "Displays weekly breathing minutes, breath-hold trends, and recent session history using data from localStorage and chart components.",
  "frontend/src/pages/Test.tsx": "Implements a breath-hold timer with start/stop controls, tracks elapsed time, and stores best records in localStorage.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load to enable PWA functionality.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, breakpoints, and plugins for the project's design system.",
  "project_state.json": "Stores metadata describing the project’s features, architecture, and current state for build or documentation tooling."
}