{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report describing conditional removal of the Player start button and its related files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind base and utility setup with extensive light/dark CSS variables and global styling rules.",
  "frontend/index.html": "HTML shell defining root mount point, manifest, theme color, and script entry.",
  "frontend/public/manifest.json": "PWA manifest with app metadata, colors, orientation, and icons.",
  "frontend/src/App.tsx": "Main router layout with header logic and bottom tab navigation, hiding footer on the Player page.",
  "frontend/src/components/BreathingCircle.tsx": "Breathing animation circle with phase-based colors, countdown text, and optional progress ring.",
  "frontend/src/components/charts/BreathHoldLineChart.tsx": "Draws a simple line chart of breath-hold durations over time with labeled endpoints.",
  "frontend/src/components/charts/WeeklyMinutesBarChart.tsx": "Shows a bar chart of weekly exercise minutes with proportional bar heights.",
  "frontend/src/components/CustomPatternForm.tsx": "Form for editing custom breathing pattern durations with numeric inputs.",
  "frontend/src/components/ExerciseTileCard.tsx": "Clickable exercise card with icon, description, and optional info button.",
  "frontend/src/components/HomeExerciseCard.tsx": "Exercise card with duration setting dialog and start interaction handling.",
  "frontend/src/components/SegmentedCircumferenceProgress.tsx": "Renders an SVG circular progress indicator split into timed segments and fills segments based on elapsed time.",
  "frontend/src/components/SessionList.tsx": "Displays a table of past breathing sessions with formatted dates and durations.",
  "frontend/src/components/VerticalVolumeControl.tsx": "Provides a vertical slider for volume control with optional icon display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBreathingEngine.ts": "Implements a timed breathing cycle engine with phases, voice cues, haptics, and pause/resume logic.",
  "frontend/src/hooks/useHaptics.ts": "Provides a simple vibration helper using the browser's vibrate API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login flow, and persistent identities via context.",
  "frontend/src/hooks/usePerExerciseDuration.ts": "Stores and retrieves per-exercise default durations using local storage.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and releases a screen wake lock based on active state.",
  "frontend/src/index.css": "Global Tailwind-based styling, theme variables, fonts, and breathing animation keyframes.",
  "frontend/src/lib/ambientAudio.ts": "Controls looping rain and waves audio with volume adjustment and exclusive playback.",
  "frontend/src/lib/breathingPatterns.ts": "Defines BreathingPattern and provides preset breathing pattern configurations.",
  "frontend/src/lib/localStorageStore.ts": "Provides helpers to read and write breath-hold records, breathing sessions, and per-exercise durations to localStorage.",
  "frontend/src/lib/playerDurationGuards.ts": "Validates session duration values and determines when auto-stop is allowed based on elapsed time.",
  "frontend/src/lib/sessionTypes.ts": "Defines types for breath-hold records and breathing sessions with timestamps and durations.",
  "frontend/src/lib/statsDerivations.ts": "Computes last 7 days of session minutes, transforms breath-hold data, and extracts recent sessions.",
  "frontend/src/lib/storageKeys.ts": "Contains string keys used for localStorage entries.",
  "frontend/src/lib/voiceGuidance.ts": "Manages voice volume and provides speech synthesis functions including async and queued speaking.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/About.tsx": "Renders the About page with app info, premium features section, and quick settings.",
  "frontend/src/pages/Custom.tsx": "Allows users to create and start a custom breathing pattern using a form.",
  "frontend/src/pages/Home.tsx": "Displays preset breathing exercises and a breath-holding test with navigation to the player.",
  "frontend/src/pages/Player.tsx": "Runs the breathing session player with pattern loading, audio control, voice guidance, duration handling, and auto-stop logic.",
  "frontend/src/pages/Settings.tsx": "Renders the Settings page with toggles for audio, haptics, and notification preferences using cards and switches.",
  "frontend/src/pages/Stats.tsx": "Displays weekly practice minutes, breath-hold trends, and recent sessions by loading data from localStorage and rendering charts and tables.",
  "frontend/src/pages/Test.tsx": "Implements a breath-hold timer with start/stop controls, tracking elapsed time and updating all‑time records in localStorage.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load to enable PWA functionality.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, screens, border radii, and plugins for animations and typography.",
  "project_state.json": "Stores the project’s feature inventory, versioning, and a high-level summary of the app’s capabilities."
}