{
  "backend/main.mo": "Empty Motoko actor placeholder for backend logic.",
  "feature_evidence.json": "Feature evidence report linking a header title change to the App.tsx file and related components.",
  "frontend-file-summaries.txt": "Aggregated auto-generated summaries of various frontend files for build planning.",
  "frontend/index.css": "Tailwind base/theme tokens and light/dark CSS variables defining the app’s color system and global styles.",
  "frontend/index.html": "HTML entry shell loading main.tsx and setting app metadata, manifest, and favicon.",
  "frontend/public/manifest.json": "PWA manifest defining app name, colors, icons, and standalone display properties.",
  "frontend/src/App.tsx": "Main router layout with header showing ZenBreathe title and footer tabs hidden on certain routes.",
  "frontend/src/components/BreathCyclesDurationDialog.tsx": "Dialog for selecting breathing cycles with increment/decrement controls and duration calculation.",
  "frontend/src/components/BreathingCircle.tsx": "Animated breathing circle that changes color and animation phase based on breathing state.",
  "frontend/src/components/charts/BreathHoldLineChart.tsx": "Draws a simple SVG line chart visualizing breath-hold durations over time.",
  "frontend/src/components/charts/WeeklyMinutesBarChart.tsx": "Renders a bar chart showing minutes spent per day relative to the week's maximum.",
  "frontend/src/components/CustomPatternForm.tsx": "Form for editing custom breathing pattern timings with numeric inputs.",
  "frontend/src/components/ExerciseTileCard.tsx": "Interactive exercise card with icon, description, and an info button.",
  "frontend/src/components/HomeExerciseCard.tsx": "Displays an interactive exercise card with icon, description, duration controls, and optional info and breathing pattern dialog.",
  "frontend/src/components/SegmentedCircumferenceProgress.tsx": "Renders a segmented circular progress indicator based on elapsed time and segment duration.",
  "frontend/src/components/SessionList.tsx": "Shows a table of past sessions with formatted dates and durations, or an empty state message.",
  "frontend/src/components/VerticalVolumeControl.tsx": "Provides a vertical slider UI for adjusting volume with optional icon display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing when identity changes.",
  "frontend/src/hooks/useBreathingEngine.ts": "Manages breathing cycle state, timing, voice prompts, and haptics for guided breathing patterns.",
  "frontend/src/hooks/useHaptics.ts": "Provides a simple vibrate helper using the browser's vibration API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and helpers for Internet Identity login, identity loading, and status tracking.",
  "frontend/src/hooks/usePerExerciseDuration.ts": "Manages per-exercise durations with localStorage persistence and defaults.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and releases a screen wake lock based on active state.",
  "frontend/src/index.css": "Defines Tailwind base layers, CSS variables for themes and breathing phases, and keyframe animations for breathing effects.",
  "frontend/src/lib/ambientAudio.ts": "Controls looping rain and waves audio with exclusive playback and adjustable volume.",
  "frontend/src/lib/breathingPatterns.ts": "Exports preset breathing patterns and a utility to compute safe cycle durations.",
  "frontend/src/lib/exerciseInfoContent.ts": "Provides structured informational text for different breathing exercises.",
  "frontend/src/lib/localStorageStore.ts": "Wraps localStorage access for session data, breath-hold records, and per-exercise durations with safe fallbacks.",
  "frontend/src/lib/playerDurationGuards.ts": "Validates session durations and prevents premature auto-stop through safety checks.",
  "frontend/src/lib/sessionTypes.ts": "Defines TypeScript interfaces for breath-hold records and breathing sessions.",
  "frontend/src/lib/settingsStore.ts": "Manages persisted user settings like ambient mode, volume, and guided meditation state.",
  "frontend/src/lib/statsDerivations.ts": "Computes derived stats such as last‑7‑days minutes, breath‑hold chart data, and recent sessions.",
  "frontend/src/lib/storageKeys.ts": "Centralizes string keys used for all localStorage entries.",
  "frontend/src/lib/voiceGuidance.ts": "Provides speech synthesis helpers for voice guidance, including queued and async speaking.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider, importing global styles.",
  "frontend/src/pages/About.tsx": "Renders an About page with app description, premium upgrade info, and quick settings, including navigation back home.",
  "frontend/src/pages/Custom.tsx": "Allows users to create a custom breathing pattern, adjust cycle count, and start a session using the configured settings.",
  "frontend/src/pages/ExerciseInfo.tsx": "Displays detailed info for a selected exercise and lets users start the associated breathing session if supported.",
  "frontend/src/pages/Home.tsx": "Shows preset breathing exercises with adjustable durations and links to start, view info, or access a breath-holding test.",
  "frontend/src/pages/Player.tsx": "Runs the breathing session with pattern loading, timing, audio, guidance, wake lock, and session logging logic.",
  "frontend/src/pages/Settings.tsx": "Provides UI to configure voice guidance, ambient sounds, and other app preferences with persistence.",
  "frontend/src/pages/Stats.tsx": "Displays weekly breathing minutes, breath-hold trend charts, and a table of the last 10 sessions using data from localStorage.",
  "frontend/src/pages/Test.tsx": "Implements a breath-hold timer with start/stop controls, tracking elapsed time and updating all‑time records in localStorage.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker on page load to enable basic PWA support.",
  "frontend/tailwind.config.js": "Tailwind config extending theme fonts, colors, screens, and borderRadius with custom CSS variables and plugins.",
  "project_state.json": "Metadata describing project features, current state, and implemented functionality for the ZenBreathe app."
}