{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report linking a timing update to SegmentedCircumferenceProgress.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference.",
  "frontend/index.css": "Tailwind base and custom CSS variables for light/dark themes and global styles.",
  "frontend/index.html": "HTML entry point loading main.tsx and PWA metadata.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, and icons.",
  "frontend/src/App.tsx": "Root layout with header, footer tabs, and route handling for main app pages.",
  "frontend/src/components/BreathingCircle.tsx": "Breathing circle UI that animates by phase and shows segmented progress when running.",
  "frontend/src/components/charts/BreathHoldLineChart.tsx": "Draws an SVG line chart plotting breath-hold durations over time with point markers.",
  "frontend/src/components/charts/WeeklyMinutesBarChart.tsx": "Shows a weekly bar chart visualizing minutes spent per day using proportional bar heights.",
  "frontend/src/components/CustomPatternForm.tsx": "Form for editing inhale/hold/exhale durations in a breathing pattern.",
  "frontend/src/components/ExerciseTileCard.tsx": "Generic exercise card with icon, description, and click handling.",
  "frontend/src/components/HomeExerciseCard.tsx": "Home exercise card with adjustable duration dialog and start action.",
  "frontend/src/components/SegmentedCircumferenceProgress.tsx": "Renders an SVG circular progress indicator split into timed segments, filling segments based on elapsed time.",
  "frontend/src/components/SessionList.tsx": "Displays a table of session history with formatted dates and durations, or a message when empty.",
  "frontend/src/components/VerticalVolumeControl.tsx": "Provides a vertical slider UI for volume control with optional icon display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useBreathingEngine.ts": "Implements timed breathing phase logic with speech, haptics, pausing, and phase transitions.",
  "frontend/src/hooks/useHaptics.ts": "Provides a simple wrapper for triggering device vibration if supported.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/usePerExerciseDuration.ts": "Stores and retrieves customizable exercise durations with local storage persistence.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and releases screen wake lock based on an active flag to prevent device sleep.",
  "frontend/src/index.css": "Global Tailwind-based styles, theme variables, typography rules, and breathing animation keyframes.",
  "frontend/src/lib/ambientAudio.ts": "Controls looping rain and waves audio with volume management and exclusive playback.",
  "frontend/src/lib/breathingPatterns.ts": "Defines the BreathingPattern interface and exports preset breathing patterns.",
  "frontend/src/lib/localStorageStore.ts": "Provides helpers to read and write breathing records, sessions, and durations in localStorage.",
  "frontend/src/lib/playerDurationGuards.ts": "Validates session durations and determines when auto‑stop should trigger safely.",
  "frontend/src/lib/sessionTypes.ts": "Defines types for breath‑hold records and breathing sessions with timestamps and durations.",
  "frontend/src/lib/statsDerivations.ts": "Generates daily minutes, breath‑hold chart data, and the latest ten sessions from stored records.",
  "frontend/src/lib/storageKeys.ts": "Contains constant localStorage key names for breathing data.",
  "frontend/src/lib/voiceGuidance.ts": "Handles speech synthesis for voice guidance, including volume, queued, and async speaking.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with app info, premium upsell, and quick settings UI.",
  "frontend/src/pages/Custom.tsx": "Allows users to create a custom breathing pattern and start a session with it.",
  "frontend/src/pages/Home.tsx": "Displays preset breathing exercises and a breath‑holding test with navigation and duration controls.",
  "frontend/src/pages/Player.tsx": "Runs the breathing session player with pattern loading, audio, voice guidance, duration logic, and session logging.",
  "frontend/src/pages/Settings.tsx": "Renders a settings page with toggles for audio, haptics, and notification preferences using cards and switches.",
  "frontend/src/pages/Stats.tsx": "Displays weekly minutes, breath-hold trends, and a table of recent sessions using charts and local storage data.",
  "frontend/src/pages/Test.tsx": "Implements a breath-hold timer with start/stop controls, live elapsed time, and all‑time record storage.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load for PWA support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, screens, and plugins for the app’s design system.",
  "project_state.json": "Describes the project state, features, and architecture metadata for the ZenBreathe app."
}