{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report placeholder with no features listed.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend files.",
  "frontend/index.css": "Tailwind base/theme setup defining light/dark CSS variables and applying global background/text styles.",
  "frontend/index.html": "HTML entrypoint loading the React app with manifest, theme color, and favicon.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, and icons.",
  "frontend/src/App.tsx": "Main app layout with router, header logic, and tabbed footer navigation hidden on certain routes.",
  "frontend/src/components/BreathingCircle.tsx": "Breathing circle component showing timed phases, animations, colors, and optional segmented progress ring.",
  "frontend/src/components/charts/BreathHoldLineChart.tsx": "Generates a simple SVG line chart of breath-hold durations over time with plotted points.",
  "frontend/src/components/charts/WeeklyMinutesBarChart.tsx": "Renders a bar chart showing weekly exercise minutes scaled relative to the maximum value.",
  "frontend/src/components/CustomPatternForm.tsx": "Form allowing users to edit inhale, hold, and exhale durations for custom breathing patterns.",
  "frontend/src/components/ExerciseTileCard.tsx": "Clickable exercise tile with icon, text, and an info button that prevents event propagation.",
  "frontend/src/components/HomeExerciseCard.tsx": "Home screen exercise card with start behavior, duration editing dialog, and optional info handler.",
  "frontend/src/components/SegmentedCircumferenceProgress.tsx": "Renders an SVG circular progress indicator split into segments with filled segments based on elapsed time.",
  "frontend/src/components/SessionList.tsx": "Displays a table of session history with formatted dates and durations.",
  "frontend/src/components/VerticalVolumeControl.tsx": "Provides a vertical slider UI component for adjusting volume with an optional icon.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBreathingEngine.ts": "Implements a timed breathing cycle engine with phases, voice guidance, haptics, and pause/resume logic.",
  "frontend/src/hooks/useHaptics.ts": "Provides a simple wrapper for triggering device vibration.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/usePerExerciseDuration.ts": "Stores and retrieves per-exercise durations with local persistence and default fallbacks.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and releases a screen wake lock based on an active state flag.",
  "frontend/src/index.css": "Defines global styling, Tailwind layers, theme variables, and breathing animation keyframes.",
  "frontend/src/lib/ambientAudio.ts": "Controls exclusive playback of rain or waves audio with adjustable volume and play/stop utilities.",
  "frontend/src/lib/breathingPatterns.ts": "Defines breathing pattern types, preset patterns, and a helper to compute safe cycle durations.",
  "frontend/src/lib/exerciseInfoContent.ts": "Provides structured instructional and informational text for each breathing exercise.",
  "frontend/src/lib/localStorageStore.ts": "Handles reading and writing breath-hold records, breathing sessions, and per‑exercise durations in localStorage.",
  "frontend/src/lib/playerDurationGuards.ts": "Validates session durations and prevents premature auto-stop via safety thresholds.",
  "frontend/src/lib/sessionTypes.ts": "Defines data structures for breath-hold records and breathing session logs.",
  "frontend/src/lib/statsDerivations.ts": "Generates weekly minutes, breath-hold chart data, and recent session lists from stored session data.",
  "frontend/src/lib/storageKeys.ts": "Centralizes localStorage key constants for all stored breathing data.",
  "frontend/src/lib/voiceGuidance.ts": "Implements speech synthesis helpers for voice guidance with volume control and queued/async modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider, rendering the root component.",
  "frontend/src/pages/About.tsx": "Renders the About page with app info, premium upsell, and quick settings UI.",
  "frontend/src/pages/Custom.tsx": "Allows users to configure a custom breathing pattern and start a session with it.",
  "frontend/src/pages/ExerciseInfo.tsx": "Displays detailed info for a selected breathing exercise, including instructions and expandable sections, with back navigation.",
  "frontend/src/pages/Home.tsx": "Shows exercise tiles allowing users to start a session, adjust duration, or view info, plus access the breath-hold test.",
  "frontend/src/pages/Player.tsx": "Runs the breathing exercise player with pattern loading, timers, audio, voice guidance, auto-stop, and session logging.",
  "frontend/src/pages/Settings.tsx": "Provides UI controls for audio, haptics, and notification preferences.",
  "frontend/src/pages/Stats.tsx": "Displays weekly breathing stats, breath-hold trends, and recent session history using charts and tables.",
  "frontend/src/pages/Test.tsx": "Implements a breath-hold timer with start/stop controls and logs durations while showing the all-time record.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load to enable PWA features.",
  "frontend/tailwind.config.js": "Tailwind config enabling class-based dark mode, custom fonts, breakpoints, OKLCH color variables, and plugins for animations and typography.",
  "project_state.json": "Project metadata describing ZenBreathe’s features, versioning, and current frontend/backend capabilities in a structured state file."
}