{
  "backend/main.mo": "Empty Motoko actor serving as backend placeholder.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for build reference.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light/dark theme tokens and global resets.",
  "frontend/index.html": "App HTML entry point loading main.tsx with PWA manifest and favicon.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, and installable icons.",
  "frontend/src/App.tsx": "Main router layout handling header, footer tabs, and route visibility rules.",
  "frontend/src/components/BreathingCircle.tsx": "Breathing circle UI with phase-based colors, animations, and optional progress ring.",
  "frontend/src/components/charts/BreathHoldLineChart.tsx": "Renders a simple SVG line chart of breath-hold durations over time.",
  "frontend/src/components/charts/WeeklyMinutesBarChart.tsx": "Bar chart showing daily minutes practiced, scaled to the week's max.",
  "frontend/src/components/CustomPatternForm.tsx": "Form for editing custom breathing pattern timings with numeric inputs.",
  "frontend/src/components/ExerciseTileCard.tsx": "Clickable exercise card with icon, description, and an isolated info button.",
  "frontend/src/components/HomeExerciseCard.tsx": "Card component for a breathing exercise with start action, info button, and optional duration editing dialog.",
  "frontend/src/components/SegmentedCircumferenceProgress.tsx": "SVG progress ring split into segments, filling segments based on elapsed time.",
  "frontend/src/components/SessionList.tsx": "Table displaying past exercise sessions with formatted date and duration.",
  "frontend/src/components/VerticalVolumeControl.tsx": "Vertical slider UI for adjusting a numeric volume value with optional icon.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor, refetching on identity changes.",
  "frontend/src/hooks/useBreathingEngine.ts": "Breathing cycle state machine with timers, voice cues, haptics, and pause/resume control.",
  "frontend/src/hooks/useHaptics.ts": "Provides a simple vibrate function using the browser haptics API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication with AuthClient.",
  "frontend/src/hooks/usePerExerciseDuration.ts": "Manages per-exercise duration settings with local storage persistence.",
  "frontend/src/hooks/useWakeLock.ts": "React hook that acquires and releases a screen wake lock based on an active flag.",
  "frontend/src/index.css": "Global Tailwind-based styles defining theme variables and breathing animations.",
  "frontend/src/lib/ambientAudio.ts": "Controller for looping rain and wave audio with volume control and exclusive playback.",
  "frontend/src/lib/breathingPatterns.ts": "Defines breathing pattern types, presets, and a helper to compute total cycle length.",
  "frontend/src/lib/exerciseInfoContent.ts": "Static content describing breathing exercises, their benefits, and methods.",
  "frontend/src/lib/localStorageStore.ts": "Utility functions to read and write breath-hold records, sessions, and durations in localStorage.",
  "frontend/src/lib/playerDurationGuards.ts": "Validates session durations and provides logic to prevent premature auto-stop.",
  "frontend/src/lib/sessionTypes.ts": "Type definitions for stored breath-hold records and breathing sessions.",
  "frontend/src/lib/statsDerivations.ts": "Transforms session data into daily minutes, breath-hold chart data, and recent sessions.",
  "frontend/src/lib/storageKeys.ts": "Constant keys used for localStorage storage of session data.",
  "frontend/src/lib/voiceGuidance.ts": "Controls speech synthesis for voice guidance with volume, queued speech, and async speech.",
  "frontend/src/main.tsx": "App entry point setting up React Query, identity provider, global styles, and rendering the app.",
  "frontend/src/pages/About.tsx": "About page displaying app info, premium teaser, and quick settings with navigation.",
  "frontend/src/pages/Custom.tsx": "Provides a form for creating a custom breathing pattern and navigates to the player with the configured settings.",
  "frontend/src/pages/ExerciseInfo.tsx": "Displays detailed info about a selected exercise and lets users start it with the mapped breathing pattern and theme color.",
  "frontend/src/pages/Home.tsx": "Shows preset breathing exercise cards, handles starting exercises, adjusting durations, and navigating to info or test pages.",
  "frontend/src/pages/Player.tsx": "Runs the breathing session with timing, audio, voice guidance, and autosave logic based on pattern, color, and duration from URL params.",
  "frontend/src/pages/Settings.tsx": "Renders configurable app settings including audio, haptics, and notifications with simple toggles.",
  "frontend/src/pages/Stats.tsx": "Loads and displays historical breathing and breath-hold data using charts and a recent sessions table.",
  "frontend/src/pages/Test.tsx": "React page that runs a breath-hold timer, tracks elapsed time, saves attempts to localStorage, and displays the all‑time record.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load to enable PWA functionality.",
  "frontend/tailwind.config.js": "Tailwind config extending fonts, colors, screens, and radius, and enabling animation and typography plugins.",
  "project_state.json": "Project metadata describing the app’s features, versions, and high-level capabilities for build/state tracking."
}