{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Metadata describing a feature requirement for enforcing a 5% margin on the breathing circle and its related files and components.",
  "frontend-file-summaries.txt": "Text listing summaries of various frontend source files and their responsibilities.",
  "frontend/index.css": "Tailwind base/theme variables and styles defining light/dark color tokens and global background/foreground rules.",
  "frontend/index.html": "HTML entry point loading the React app and registering the PWA manifest and favicon.",
  "frontend/public/manifest.json": "PWA manifest providing app metadata, theme colors, and icons for installation.",
  "frontend/src/App.tsx": "Main application router and layout with header, footer tabs, and route-aware UI behavior.",
  "frontend/src/components/BreathingCircle.tsx": "Breathing circle component rendering animated inhale/exhale states with optional progress ring.",
  "frontend/src/components/charts/BreathHoldLineChart.tsx": "Draws a simple line chart of breath-hold durations with points and date labels.",
  "frontend/src/components/charts/WeeklyMinutesBarChart.tsx": "Shows a weekly bar chart of minutes spent, scaling bar heights relative to the max value.",
  "frontend/src/components/CustomPatternForm.tsx": "Form for editing custom breathing pattern durations with four numeric fields.",
  "frontend/src/components/ExerciseTileCard.tsx": "Tappable exercise tile showing icon, title, description, and an info button.",
  "frontend/src/components/HomeExerciseCard.tsx": "Home-screen exercise card with start action and a dialog for changing duration.",
  "frontend/src/components/SegmentedCircumferenceProgress.tsx": "Renders an SVG circular progress indicator split into segments and fills them based on elapsed time.",
  "frontend/src/components/SessionList.tsx": "Displays a table of past sessions with formatted dates and durations, or a message when empty.",
  "frontend/src/components/VerticalVolumeControl.tsx": "A vertical slider component for volume control with optional icon display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBreathingEngine.ts": "Manages breathing cycle state, timing, voice guidance, vibration, and phase transitions for exercises.",
  "frontend/src/hooks/useHaptics.ts": "Provides a simple vibration helper using the browser's navigator API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication, storing identity state and exposing login/logout helpers.",
  "frontend/src/hooks/usePerExerciseDuration.ts": "Manages per-exercise duration settings with local storage persistence.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and releases screen wake lock based on an active flag to prevent device sleep.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, theme variables, and breathing animation keyframes.",
  "frontend/src/lib/ambientAudio.ts": "Controls rain and waves audio playback with volume management and exclusive play modes.",
  "frontend/src/lib/breathingPatterns.ts": "Defines the BreathingPattern interface and exports preset breathing patterns.",
  "frontend/src/lib/localStorageStore.ts": "Provides helpers to read and write breath-hold records, breathing sessions, and per‑exercise durations to localStorage.",
  "frontend/src/lib/playerDurationGuards.ts": "Validates session durations and enforces auto‑stop rules based on elapsed time.",
  "frontend/src/lib/sessionTypes.ts": "Defines types for breath‑hold records and breathing sessions with timestamps and durations.",
  "frontend/src/lib/statsDerivations.ts": "Computes daily minutes, breath‑hold chart data, and extracts the last 10 breathing sessions.",
  "frontend/src/lib/storageKeys.ts": "Contains constant string keys used for localStorage persistence.",
  "frontend/src/lib/voiceGuidance.ts": "Handles voice guidance via speech synthesis, offering volume control and async or queued speech functions.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/About.tsx": "Renders the About page with app info, premium upsell section, and quick settings display.",
  "frontend/src/pages/Custom.tsx": "Allows users to create and start a custom breathing pattern via a form.",
  "frontend/src/pages/Home.tsx": "Displays preset breathing exercises and a breath‑holding test, enabling navigation to the player.",
  "frontend/src/pages/Player.tsx": "Runs the breathing session player with pattern loading, duration validation, ambient audio, voice control, and auto‑stop logic.",
  "frontend/src/pages/Settings.tsx": "Renders the Settings page with toggles for audio options, haptics, and notification preferences. Includes navigation back to home and uses multiple Card sections for grouped settings.",
  "frontend/src/pages/Stats.tsx": "Displays weekly minutes, breath-hold trends, and a table of recent sessions using stored session data. Fetches and formats local history for charts and tables on mount.",
  "frontend/src/pages/Test.tsx": "Implements a breath-hold timer that tracks elapsed time, saves results to local storage, and shows the all-time record. Provides start/stop controls and time formatting.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load to enable PWA functionality. Handles success or failure silently.",
  "frontend/tailwind.config.js": "Tailwind config defining dark mode, content paths, extended theme values, custom colors, and plugins. Adds responsive breakpoints, font settings, and semantic color tokens.",
  "project_state.json": "Stores project metadata, description, and a catalog of implemented features with identifiers and versions. Outlines the app’s routing, breathing patterns, UI behaviors, and local persistence features."
}