{
  "backend/main.mo": "Minimal Motoko actor with no implemented methods.",
  "feature_evidence.json": "Feature evidence report linking a voice countdown feature to affected frontend files and components.",
  "frontend-file-summaries.txt": "Aggregated descriptions of all frontend files for reference and build planning.",
  "frontend/index.css": "Root CSS variables and Tailwind base layers defining light/dark theme tokens and global styles.",
  "frontend/index.html": "HTML entry point wiring the root div, manifest, favicon, and main TypeScript bundle.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, and standalone launch behavior.",
  "frontend/src/App.tsx": "Main app shell with header, tabbed footer navigation, and route layout using TanStack Router.",
  "frontend/src/components/BreathingCircle.tsx": "Visual breathing circle showing countdown text, phase colors, and animations tied to engine state.",
  "frontend/src/components/charts/BreathHoldLineChart.tsx": "Generates an SVG line chart visualizing breath-hold durations over time, with points and date labels.",
  "frontend/src/components/charts/WeeklyMinutesBarChart.tsx": "Displays a weekly bar chart of minutes spent, scaling bar heights relative to the max value.",
  "frontend/src/components/CustomPatternForm.tsx": "Form for editing inhale/hold/exhale durations in a custom breathing pattern.",
  "frontend/src/components/ExerciseTileCard.tsx": "Clickable exercise tile with title, description, icon, and info button for home screen grids.",
  "frontend/src/components/HomeExerciseCard.tsx": "Home exercise card with adjustable duration dialog, clickable start action, and accessibility keys.",
  "frontend/src/components/SessionList.tsx": "Renders a table of breathing sessions with formatted dates and durations, or a placeholder message when empty.",
  "frontend/src/components/VerticalVolumeControl.tsx": "Vertical slider component for adjusting a numeric value with optional icon display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useBreathingEngine.ts": "Manages breathing phase timing, voice cues, haptics, and start/pause/resume logic for breathing exercises.",
  "frontend/src/hooks/useHaptics.ts": "Provides a simple vibration helper using the browser’s vibrate API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication state, login flow, and identity persistence through context.",
  "frontend/src/hooks/usePerExerciseDuration.ts": "Stores and retrieves per‑exercise duration settings using local storage.",
  "frontend/src/hooks/useWakeLock.ts": "Requests and manages a screen wake lock while a given activity is active.",
  "frontend/src/index.css": "Tailwind base styles, theme variables, typography rules, and animations for breathing UI effects.",
  "frontend/src/lib/ambientAudio.ts": "Controls looping rain and waves audio playback with exclusive play behavior and adjustable volume.",
  "frontend/src/lib/breathingPatterns.ts": "Defines the BreathingPattern interface and preset breathing patterns such as equal, box, and 4‑7‑8.",
  "frontend/src/lib/localStorageStore.ts": "Provides helpers to read and write breath-hold records, breathing sessions, and per‑exercise durations in localStorage with safe fallbacks.",
  "frontend/src/lib/playerDurationGuards.ts": "Validates session durations and determines when auto‑stop is allowed to prevent premature termination.",
  "frontend/src/lib/sessionTypes.ts": "Defines TypeScript interfaces for breath‑hold records and breathing sessions.",
  "frontend/src/lib/statsDerivations.ts": "Calculates daily minutes, breath‑hold chart data, and returns the last 10 sessions from stored records.",
  "frontend/src/lib/storageKeys.ts": "Exports constant keys used for localStorage entries.",
  "frontend/src/lib/voiceGuidance.ts": "Controls speech synthesis for voice guidance, including volume, queued speech, async speech, and cancelation.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/About.tsx": "Renders the About page with app info, premium upsell, and static settings display.",
  "frontend/src/pages/Custom.tsx": "Lets users build a custom breathing pattern and start it via navigation to the player.",
  "frontend/src/pages/Home.tsx": "Displays preset breathing patterns, manages per‑exercise durations, and links to the test and player screens.",
  "frontend/src/pages/Player.tsx": "Runs the breathing session player, loading pattern data, managing audio, voice, duration, logging sessions, and auto‑stop behavior.",
  "frontend/src/pages/Settings.tsx": "Renders settings UI for audio, haptics, and notifications using switches and cards with navigation back to home.",
  "frontend/src/pages/Stats.tsx": "Displays weekly breathing minutes, breath-hold chart, and recent sessions by loading local history and rendering charts and a table.",
  "frontend/src/pages/Test.tsx": "Implements a breath-hold timer with start/stop controls, persists records, and shows the all‑time best duration.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on load to enable PWA functionality.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, screens, fonts, and plugins for the project.",
  "project_state.json": "Stores the project’s feature inventory, metadata, and high‑level summary of the ZenBreathe app."
}