{
  "kind": "build_request",
  "title": "Fix segmented circumference progress timing (fill exactly one segment every 8 seconds)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Update the segmented circumference progress indicator so the filled portion advances by exactly one segment every 8 seconds of elapsed session time (i.e., segment 1 fills at 8s, segment 2 at 16s, etc.), up to the total number of segments (totalDurationSeconds/8, rounded up). This change must only affect the segmented circumference timing/fill behavior and must not change the breathing circle’s size, layout, colors, or other Player behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "just the circumference thing",
          "YES",
          "proceeding with the build that applies ONLY the segmented‑circumference timing fix."
        ]
      },
      "acceptanceCriteria": [
        "For totalDurationSeconds = 32 (totalSegments = 4), the indicator shows 0 filled segments for elapsedSeconds in [0, 8), 1 filled segment for elapsedSeconds in [8, 16), 2 for [16, 24), 3 for [24, 32), and 4 for elapsedSeconds >= 32.",
        "For any totalDurationSeconds > 0, the filled segment count never exceeds totalSegments and never decreases as elapsedSeconds increases.",
        "No changes are made to Player layout, breathing circle sizing, colors, typography, or any other Player flow besides the segmented circumference progress fill/timing behavior."
      ]
    }
  ],
  "constraints": [
    "Frontend-only change: implement only the segmented circumference progress timing/fill fix.",
    "Do not modify any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Do not address other pending Player fixes (circle sizing, phase text placement, Start/Stop behavior, pre-session intro, voice guidance, etc.).",
    "Do not add or change backend canister functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}