{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Spoken 4-3-2-1 countdown synced to session-start breathing circle countdown",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Speak “4 3 2 1” in sync with the breathing circle’s initial visible countdown ticks at session start, respecting voice volume and canceling speech on pause/stop.",
      "acceptanceCriteria": [
        "When the user taps Start in the Player, the breathing circle begins its normal countdown and the app speaks “4”, then “3”, then “2”, then “1” aligned to the visible countdown ticks at the start of the session.",
        "The spoken 4-3-2-1 countdown occurs as part of the breathing circle countdown behavior (not as a separate screen or pre-session intro).",
        "The spoken countdown respects the existing voice guidance volume control.",
        "If the session is paused or stopped during the initial countdown, any ongoing speech is canceled and the countdown speech does not continue while paused/stopped."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/voiceGuidance.ts",
          "operation": "modify",
          "description": "Add a queued/non-interrupting speech helper (e.g., a function that speaks without canceling existing utterances) so the 4-3-2-1 countdown can play reliably on one-second ticks while preserving existing interrupting behavior for other voice prompts."
        },
        {
          "path": "frontend/src/hooks/useBreathingEngine.ts",
          "operation": "modify",
          "description": "Integrate a session-start spoken countdown into the existing breathing timing loop: track which initial countdown numbers have been spoken, speak “4 3 2 1” aligned to the circle’s displayed Math.ceil(timeRemaining) ticks at the very beginning of the session (without adding any new intro flow), suppress/avoid overlapping initial phase announcement as needed, and ensure pause/stop cancel any ongoing speech and prevent further countdown speech while paused/stopped."
        }
      ]
    }
  ]
}